package Sem.date221121.HW2;

// import java.util.Scanner;

public class HW_t2 {
    // 2. Напишите программу на Java, чтобы проверить, являются ли две данные строки вращением друг друга.
    public static void main(String[] args) {
                       
        // Scanner iScanner = new Scanner(System.in);
        // System.out.printf("Введите строку: ");
        // String one_string = iScanner.nextLine();
        // System.out.printf("Введите вторую строку: ");
        // String two_string = iScanner.nextLine();
        



        // iScanner.close();
    }
}
